Goal_App/project/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
---
    def show
        # debugger
        @user = User.find(params[:id])